app/Http/Controllers/OrderController.php

    public function show(Order $order)
    {
       // foreach ($order->products as $product) {
       //     $product->pivot->price;
      //  }
      //  dd($order->products->count());
      $order->load('products');
---
select `products`.*, `details`.`order_id` as `pivot_order_id`, `details`.`product_id` as `pivot_product_id`, `details`.`price` as `pivot_price`, `details`.`quantity` as `pivot_quantity`, `details`.`total` as `pivot_total`, `details`.`created_at` as `pivot_created_at`, `details`.`updated_at` as `pivot_updated_at` from `products` inner join `details` on `products`.`id` = `details`.`product_id` where `details`.`order_id` in (26) and `products`.`deleted_at` is null

    public function edit(Order $order)
    {
        return view('admin.order.edit', [
            'order' => $order,
            'orders' => Order::all(),
            'clients'=> Client::all(),
            'users'=> User::all(),
            'products'=> Product::all(),
---
select * from `orders` where `orders`.`deleted_at` is null
select * from `clients`
select * from `users`
select * from `products` where `products`.`deleted_at` is null